"""
Назарова Владислава КИ21-17/1б
вариант - 17

Описание задания

Дан набор букв латинского алфавита, причём известно, что некоторые
буквы помечены как «сломанные». Из букв этого набора создаётся строка
𝑆𝑇𝑅𝐼𝐼𝑁𝐺, причём когда необходимо использовать «сломанный» символ, в строке
𝑆𝑇𝑅𝐼𝐼𝑁𝐺 этот символ дублируется (см. примечание 2). Необходимо проверить,
используя собранную строку 𝑆𝑇𝑅𝐼𝐼𝑁𝐺, какие именно буквы были помечены
«сломанными».

Примечание 1: во входной строке «𝐴𝑍𝑍𝐴𝐴» символ «𝑍» является
«сломанным», а «𝐴» – «нормальным».

Примечание 2: если буква латинского алфавита в строке не используется,
то она считается «нормальной» за неимением доказательств.
"""


def main():
    entered_string = input()
    amount = 0
    broken_letters = set()              # множество букв, которые возможно являются 'сломанными'
    pseudo_broken_letters = set()       # множество букв, которые точно не являются 'сломанными'
    letter = entered_string[0]
    for i in entered_string:
        if i == letter:
            amount += 1
        else:
            if amount % 2 == 0:
                broken_letters.add(letter)
            else:
                pseudo_broken_letters.add(letter)
            letter = i
            amount = 1
    print(broken_letters - pseudo_broken_letters)


if __name__ == '__main__':
    main()
